BPEL/CompositeApp1/test/TestCase1(getCallsInfoOperation)/Input.xml

<soapenv:Envelope xsi:schemaLocation="http://schemas.xmlsoap.org/soap/envelope/ http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:com="CompositeApp1">
  <soapenv:Body>
    <com:getCallsInfoOperation>
      <clientId>?10?</clientId>
      <month>?3?</month>
      <year>?3?</year>
    </com:getCallsInfoOperation>
  </soapenv:Body>
</soapenv:Envelope>